---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.IWideFlange
enum: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape
source: html/daaa1d33-7ee8-738a-5ab7-b93f056deaf8.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.IWideFlange

Defines parameters for I-shape Wide Flange structural sections.